// Запропонуйте користувачу ввести число за допомогою prompt().
// Збережіть введене значення у змінну number.
// Перевірте, чи дорівнює змінна number числу 10:
//    Якщо так – виведіть повідомлення 'Вірно' у alert().
//    Якщо ні – виведіть 'Невірно'.

// Підказка: prompt завжди повертає рядок (String), тому перед перевіркою
// перетворіть значення на число за допомогою Number().


// const number = prompt("введіть число");
// function askNumberser() {
//     if (Number(number) === 10) {
//         alert("вірно");
//     }
//     else {
//         alert("не вірно");
//     }
// }

// console.log(number);


/*=========================завдання 2===============================*/


// У змінній min лежить випадкове число від 0 до 59.
// Визначте, в яку чверть години потрапляє
// це число (у першу, другу, третю чи четверту).
// Виведіть в alert відповідне повідомлення, наприклад:
// "10 входить в першу чверть"

// const min = Math.floor(Math.random() * (59 - 0) + 0);

// function clockTime() {
//     let number = +prompt('Введіть число');

//     if (number <= 15) {
//         alert(`число ${number} входить в першу чверть`);
//     }
//     else if (number > 15 && number <= 30) {
//        alert(`число ${number} входить в другу чверть`);
//     }
//     else if (number > 30 && number <= 45) {
//         alert(`число ${number} входить в третю чверть`);
//     }
//     else {
//         alert(`число ${number} входить в четверту чверть`);
//     }
// }
// clockTime()

/*=========================завдання 3===============================*/

// Змінна num може набувати 4 значення: '1', '2', '3' або '4'
// (запитуй це значення у користувача через prompt).
// Якщо вона має значення '1', то у змінну result запишіть 'зима',
// якщо має значення '2' - 'весна' і так далі.
// Розв'яжіть завдання через switch-case.
// Не забудьте про дефолтне значення, на випадок, якщо користувач
// введе в prompt щось інше. В такому випадку result має набувати значення:
// "Вибачте, але ви маєте ввести значення від 1 до 4 включно".
// Значення змінної result виведіть в консоль.


// function bold(params) {
//     let weather = prompt(`Введіть значення`)
//     switch (weather) {
//         case '1':
//             alert('зима')
//             break;
//          case '2':
//             alert('весна')
//             break;
//          case '3':
//             alert('літо')
//             break;
//          case '4':
//             alert('осінь')
//             break;
    
//         default:
//             alert('Є тільки 4 пори року')
           
//     }
// }
// bold()

/*=========================завдання 4===============================*/

// Отримуйте від користувача число (кількість хвилин) через prompt
// і виводьте у консоль рядок у форматі годин та хвилин.
// Приклад: користувач вводить в prompt '70' -> в консолі відобразиться '01:10'.
// Корисне посилання для відображення годин та хвилин у потрібному форматі ('01' замість '1'):
// https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/String/padStart#examples



// const minutesInput = prompt("Введіть кількість хвилин:");
// const totalMinutes = Number(minutesInput);

// const hours = String(Math.floor(totalMinutes / 60)).padStart(2, "0");
// const minutes = String(totalMinutes % 60).padStart(2, "0");

// console.log(`${hours}:${minutes}`);
    

/*=========================завдання 5===============================*/

